<a href="https://colab.research.google.com/github/arora123/Statistics-for-Data-Science-using-Python/blob/main/OTS_Session1_Data_Cleaning_1.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

# Data Cleaning using pandas
##Missing values Treatment

dropna()
fillna()

In [2]:
# import data set
import pandas as pd
bank = pd.read_csv('https://raw.githubusercontent.com/arora123/Data/master/bank.csv')
bank

      Year  Month Quarter  Balance  Withdrawal
0   2000.0      1      Q1  10000.0         NaN
1      NaN      2     NaN      NaN         NaN
2      NaN      3     NaN      NaN         NaN
3      NaN      4      Q2   6000.0      4000.0
4      NaN      5     NaN      NaN         NaN
5      NaN      6     NaN      NaN         NaN
6      NaN      7      Q3      NaN         NaN
7      NaN      8     NaN   3000.0      3000.0
8      NaN      9     NaN   2000.0      1000.0
9      NaN     10      Q4      NaN         NaN
10     NaN     11     NaN      NaN         NaN
11     NaN     12     NaN   1000.0      1000.0

In [3]:
bank.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 12 entries, 0 to 11
Data columns (total 5 columns):
 #   Column      Non-Null Count  Dtype
---  ------      --------------  -----
 0   Year        1 non-null      float64
 1   Month       12 non-null     int64
 2   Quarter     4 non-null      object
 3   Balance     5 non-null      float64
 4   Withdrawal  4 non-null      float64
dtypes: float64(3), int64(1), object(1)
memory usage: 608.0+ bytes

In [4]:
bank.describe(include='all')

          Year      Month Quarter       Balance  Withdrawal
count      1.0  12.000000       4      5.000000         4.0
unique     NaN        NaN       4           NaN         NaN
top        NaN        NaN      Q4           NaN         NaN
freq       NaN        NaN       1           NaN         NaN
mean    2000.0   6.500000     NaN   4400.000000      2250.0
std        NaN   3.605551     NaN   3646.916506      1500.0
min     2000.0   1.000000     NaN   1000.000000      1000.0
25%     2000.0   3.750000     NaN   2000.000000      1000.0
50%     2000.0   6.500000     NaN   3000.000000      2000.0
75%     2000.0   9.250000     NaN   6000.000000      3250.0
max     2000.0  12.000000     NaN  10000.000000      4000.0

In [5]:
bank[['Balance', 'Withdrawal']].describe()

            Balance  Withdrawal
count      5.000000         4.0
mean    4400.000000      2250.0
std     3646.916506      1500.0
min     1000.000000      1000.0
25%     2000.000000      1000.0
50%     3000.000000      2000.0
75%     6000.000000      3250.0
max    10000.000000      4000.0

In [6]:
# To check missing values
# bank.isnull()

# To see the count of missing values column wise
bank.isnull().sum()

Year          11
Month          0
Quarter        8
Balance        7
Withdrawal     8
dtype: int64

In [7]:
# To see the count of missing values row wise    
bank.isnull().sum(axis=1)

0     1
1     4
2     4
3     1
4     4
5     4
6     3
7     2
8     2
9     3
10    4
11    2
dtype: int64

In [8]:
bank.isnull().sum().sort_values(ascending=False) # Check missing values in descending order

Year          11
Withdrawal     8
Quarter        8
Balance        7
Month          0
dtype: int64

In [9]:
# remove rows with  'any' missing values

bank.dropna()

# remove columns with  'any' missing values

bank.dropna(axis=1)

    Month
0       1
1       2
2       3
3       4
4       5
5       6
6       7
7       8
8       9
9      10
10     11
11     12

In [10]:
# remove rows with  'all' missing values

# bank.dropna(how='all')

# remove columns with  'all' missing values

bank.dropna(axis=1, how='all')

      Year  Month Quarter  Balance  Withdrawal
0   2000.0      1      Q1  10000.0         NaN
1      NaN      2     NaN      NaN         NaN
2      NaN      3     NaN      NaN         NaN
3      NaN      4      Q2   6000.0      4000.0
4      NaN      5     NaN      NaN         NaN
5      NaN      6     NaN      NaN         NaN
6      NaN      7      Q3      NaN         NaN
7      NaN      8     NaN   3000.0      3000.0
8      NaN      9     NaN   2000.0      1000.0
9      NaN     10      Q4      NaN         NaN
10     NaN     11     NaN      NaN         NaN
11     NaN     12     NaN   1000.0      1000.0

In [11]:
bank.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 12 entries, 0 to 11
Data columns (total 5 columns):
 #   Column      Non-Null Count  Dtype
---  ------      --------------  -----
 0   Year        1 non-null      float64
 1   Month       12 non-null     int64
 2   Quarter     4 non-null      object
 3   Balance     5 non-null      float64
 4   Withdrawal  4 non-null      float64
dtypes: float64(3), int64(1), object(1)
memory usage: 608.0+ bytes

In [12]:
# print(len(bank)) 
print(bank.shape)
print(bank.dtypes)

(12, 5)
Year          float64
Month           int64
Quarter        object
Balance       float64
Withdrawal    float64
dtype: object

Contains many missing values in all columns except 'Month'

In [13]:
bank.isnull()

     Year  Month  Quarter  Balance  Withdrawal
0   False  False    False    False        True
1    True  False     True     True        True
2    True  False     True     True        True
3    True  False    False    False       False
4    True  False     True     True        True
5    True  False     True     True        True
6    True  False    False     True        True
7    True  False     True    False       False
8    True  False     True    False       False
9    True  False    False     True        True
10   True  False     True     True        True
11   True  False     True    False       False

In [14]:
# Check if missing values in one column
print(bank['Year'].isnull())
# check summary of all numeric columns of data frame
print(bank.describe())

0     False
1      True
2      True
3      True
4      True
5      True
6      True
7      True
8      True
9      True
10     True
11     True
Name: Year, dtype: bool
         Year      Month       Balance  Withdrawal
count     1.0  12.000000      5.000000         4.0
mean   2000.0   6.500000   4400.000000      2250.0
std       NaN   3.605551   3646.916506      1500.0
min    2000.0   1.000000   1000.000000      1000.0
25%    2000.0   3.750000   2000.000000      1000.0
50%    2000.0   6.500000   3000.000000      2000.0
75%    2000.0   9.250000   6000.000000      3250.0
max    2000.0  12.000000  10000.000000      4000.0

In [15]:
print('Some of the important summary numbers for column named Balance are : \n')
print('Data Type is ', bank['Balance'].dtypes)
print('Mean is ', bank['Balance'].mean())
print('median is ', bank['Balance'].median())
print('std is ', bank['Balance'].std())
print('skewness is ',  bank['Balance'].skew(), '\n')

print('7 point summary is here: \n\n\n',  bank['Balance'].describe())

Some of the important summary numbers for column named Balance are :

Data Type is  float64
Mean is  4400.0
median is  3000.0
std is  3646.916505762094
skewness is  1.0638300169445647

7 point summary is here:


 count        5.000000
mean      4400.000000
std       3646.916506
min       1000.000000
25%       2000.000000
50%       3000.000000
75%       6000.000000
max      10000.000000
Name: Balance, dtype: float64

In [16]:
# Get summary of all columns 
# bank.describe(include='all')
bank.describe(include='all').round(2)

          Year  Month Quarter   Balance  Withdrawal
count      1.0  12.00       4      5.00         4.0
unique     NaN    NaN       4       NaN         NaN
top        NaN    NaN      Q4       NaN         NaN
freq       NaN    NaN       1       NaN         NaN
mean    2000.0   6.50     NaN   4400.00      2250.0
std        NaN   3.61     NaN   3646.92      1500.0
min     2000.0   1.00     NaN   1000.00      1000.0
25%     2000.0   3.75     NaN   2000.00      1000.0
50%     2000.0   6.50     NaN   3000.00      2000.0
75%     2000.0   9.25     NaN   6000.00      3250.0
max     2000.0  12.00     NaN  10000.00      4000.0

In [17]:
#@title
bank.groupby('Quarter').mean()
# bank.hist()

           Year  Month  Balance  Withdrawal
Quarter
Q1       2000.0      1  10000.0         NaN
Q2          NaN      4   6000.0      4000.0
Q3          NaN      7      NaN         NaN
Q4          NaN     10      NaN         NaN

In [18]:
# Get column names
print(bank.columns)

Index(['Year', 'Month', 'Quarter', 'Balance', 'Withdrawal'], dtype='object')

In [19]:
# select one column
print(bank['Year'])
# print(bank[['Year']])
# print(bank.Year)

# select multiple columns
# print(bank[['Balance', 'Year']])


# select second to fourth columns
# bank[bank.columns[1:4]]

0     2000.0
1        NaN
2        NaN
3        NaN
4        NaN
5        NaN
6        NaN
7        NaN
8        NaN
9        NaN
10       NaN
11       NaN
Name: Year, dtype: float64

In [20]:
# select few rows and few columns
bank.loc[0:3, ['Month', 'Balance']]


# select all rows, and few columns
# bank.loc[:, 'Month']
bank.iloc[:, 2:3]  


# select few rows and all column
bank.loc[0:5, :]

     Year  Month Quarter  Balance  Withdrawal
0  2000.0      1      Q1  10000.0         NaN
1     NaN      2     NaN      NaN         NaN
2     NaN      3     NaN      NaN         NaN
3     NaN      4      Q2   6000.0      4000.0
4     NaN      5     NaN      NaN         NaN
5     NaN      6     NaN      NaN         NaN

## Checking for missing values

1. Column wise missing values
2. Row wise missing values

In [21]:
# 1. Column wise
print(bank.isnull())

print(bank.isnull().sum())

print(bank.notnull().sum())  # non null value counts

     Year  Month  Quarter  Balance  Withdrawal
0   False  False    False    False        True
1    True  False     True     True        True
2    True  False     True     True        True
3    True  False    False    False       False
4    True  False     True     True        True
5    True  False     True     True        True
6    True  False    False     True        True
7    True  False     True    False       False
8    True  False     True    False       False
9    True  False    False     True        True
10   True  False     True     True        True
11   True  False     True    False       False
Year          11
Month          0
Quarter        8
Balance        7
Withdrawal     8
dtype: int64
Year           1
Month         12
Quarter        4
Balance        5
Withdrawal     4
dtype: int64

In [22]:
print('Is there any missing value in year column? ', bank['Year'].isnull(), '\n')

print('How many missing in year column? ', bank['Year'].isnull().sum())

Is there any missing value in year column?  0     False
1      True
2      True
3      True
4      True
5      True
6      True
7      True
8      True
9      True
10     True
11     True
Name: Year, dtype: bool

How many missing in year column?  11

In [23]:
# 2. Row wise

bank.isnull().sum(axis=1) # axis = 1 for rowwise sum, default is axis=0

0     1
1     4
2     4
3     1
4     4
5     4
6     3
7     2
8     2
9     3
10    4
11    2
dtype: int64

## Drop Missing values
1. drop column
2. drop rows

If you want to simply exclude the missing values, then use the dropna function along with the axis argument. 

By default, axis=0, i.e., along row, which means that if any value within a row is NA then the whole row is excluded.

In [24]:
bank.dropna()
#By default, axis=0, i.e., along row, which means that if any value within a row is NA then the whole row is excluded.

Empty DataFrame
Columns: [Year, Month, Quarter, Balance, Withdrawal]
Index: []

In [25]:
bank.dropna(axis=1)
# By setting, axis=1, i.e., along column, which means that if any value within a column is NA then the whole column is excluded.

    Month
0       1
1       2
2       3
3       4
4       5
5       6
6       7
7       8
8       9
9      10
10     11
11     12

In [26]:
bank.dropna(axis=1, how='all')
bank.dropna(axis=0, how='all')

      Year  Month Quarter  Balance  Withdrawal
0   2000.0      1      Q1  10000.0         NaN
1      NaN      2     NaN      NaN         NaN
2      NaN      3     NaN      NaN         NaN
3      NaN      4      Q2   6000.0      4000.0
4      NaN      5     NaN      NaN         NaN
5      NaN      6     NaN      NaN         NaN
6      NaN      7      Q3      NaN         NaN
7      NaN      8     NaN   3000.0      3000.0
8      NaN      9     NaN   2000.0      1000.0
9      NaN     10      Q4      NaN         NaN
10     NaN     11     NaN      NaN         NaN
11     NaN     12     NaN   1000.0      1000.0

## Filling missing values

1. For Year, Quarter, Balance; logically we need to fill value from previous record

fillna(method='ffill') or  fillna(method='pad') will do the job

[In R, we use fill()]

2. For Withdrawl column, we belive missing value represent no withdrawl.

so we can replace those by '0'

fillna(0) will do the job

[In R, we use replace_na()]

In [27]:
bank[['Year', 'Quarter', 'Balance']]= bank[['Year', 'Quarter', 'Balance']].fillna(method='ffill')
bank

      Year  Month Quarter  Balance  Withdrawal
0   2000.0      1      Q1  10000.0         NaN
1   2000.0      2      Q1  10000.0         NaN
2   2000.0      3      Q1  10000.0         NaN
3   2000.0      4      Q2   6000.0      4000.0
4   2000.0      5      Q2   6000.0         NaN
5   2000.0      6      Q2   6000.0         NaN
6   2000.0      7      Q3   6000.0         NaN
7   2000.0      8      Q3   3000.0      3000.0
8   2000.0      9      Q3   2000.0      1000.0
9   2000.0     10      Q4   2000.0         NaN
10  2000.0     11      Q4   2000.0         NaN
11  2000.0     12      Q4   1000.0      1000.0

In [28]:
# 2. Replacing missing values in Withdrawl column by '0'

bank[['Withdrawal']]= bank[['Withdrawal']].fillna(0)
bank

      Year  Month Quarter  Balance  Withdrawal
0   2000.0      1      Q1  10000.0         0.0
1   2000.0      2      Q1  10000.0         0.0
2   2000.0      3      Q1  10000.0         0.0
3   2000.0      4      Q2   6000.0      4000.0
4   2000.0      5      Q2   6000.0         0.0
5   2000.0      6      Q2   6000.0         0.0
6   2000.0      7      Q3   6000.0         0.0
7   2000.0      8      Q3   3000.0      3000.0
8   2000.0      9      Q3   2000.0      1000.0
9   2000.0     10      Q4   2000.0         0.0
10  2000.0     11      Q4   2000.0         0.0
11  2000.0     12      Q4   1000.0      1000.0

In [29]:
bank.isnull().sum()

Year          0
Month         0
Quarter       0
Balance       0
Withdrawal    0
dtype: int64